Catalogs/СтруктураОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>СтруктураОрганизации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
	</Catalog>
</MetaDataObject>

InformationRegisters/СтруктураОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>СтруктураОрганизации</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Элемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураОрганизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/СтруктураОрганизации/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    тДерево = РеквизитФормыВЗначение("Дерево");
 
   Запрос = Новый Запрос;
   Запрос.Текст = "ВЫБРАТЬ
                  |	СтруктураОрганизации.Ссылка КАК Реквизит2,
                  |	СтруктураОрганизацииСрезПоследних.Родитель КАК Реквизит1
                  |ИЗ
                  |	Справочник.СтруктураОрганизации КАК СтруктураОрганизации 
                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураОрганизации.СрезПоследних КАК СтруктураОрганизацииСрезПоследних
                  |		ПО СтруктураОрганизацииСрезПоследних.Элемент = СтруктураОрганизации.Ссылка";
   Выгрузка = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам); 
 
   тДерево = Выгрузка;
 
   ЗначениеВРеквизитФормы(тДерево, "Дерево");
КонецПроцедуры
